[Reference](https://medium.com/analytics-vidhya/introduction-to-pandas-dataframe-query-function-60b5408ae58b)

In [1]:
import pandas as pd 
import numpy as np 
df= pd.DataFrame({'Name':['Vikram','John', 'Alex','Paul','Andrew','Rafel' ], 
'Age':[28,39,21,50,35,43], 
'Department':['HR', 'Finance','IT','HR','IT','IT'], 
'Country':['USA','India','Germany','USA','India','India'] }) 

print(df.head())

     Name  Age Department  Country
0  Vikram   28         HR      USA
1    John   39    Finance    India
2    Alex   21         IT  Germany
3    Paul   50         HR      USA
4  Andrew   35         IT    India

In [2]:
print(df.query('Department == "IT"'))

     Name  Age Department  Country
2    Alex   21         IT  Germany
4  Andrew   35         IT    India
5   Rafel   43         IT    India

In [3]:
print(df.query('Department == "IT" and Country != "India" '))

   Name  Age Department  Country
2  Alex   21         IT  Germany

In [4]:
print(df.query('Age>= 40 or Country =="India"'))

     Name  Age Department Country
1    John   39    Finance   India
3    Paul   50         HR     USA
4  Andrew   35         IT   India
5   Rafel   43         IT   India

In [10]:
Location= "India" 
print(df.query('Country == @Location'))

     Name  Age Department Country
1    John   39    Finance   India
4  Andrew   35         IT   India
5   Rafel   43         IT   India